'''
TCP 协议 传输控制协议，
    是一中面向链接的可靠的，基于字节流的传输通信协议
    
tcp通信需要经过 创建链接、数据传送、终止链接 三件事
tcp的可靠传输：
    1 tcp采用发送应答机制
    2 超时重传
    3 错误校验
    4 流量控制和阻塞管理
    
tcp与udp的不同点
    面向链接 三次握手 确认链接之后才传输
    有序数据传输
    重发丢失的数据包
    无差错的数据传输
    阻塞/流量控制

'''
'''
tcp: 
    面向链接的可靠的基于字节流的传输控制协议
    1 建立连接
    2 数据传输
    3 关闭链接
可靠性：
    1 应答机制
    2 超时重发
    3 错误校验
    4 流量控制与阻塞管理
    
三次握手：
    1 SYN
    2 SYN + ACK
    3 ACK
数据传输：
    1 PSH 1000 客户端发送信息给服务器
    2 服务器：无数据：ACK 1001 有数据：PSH + ACK 800(20) 1001
    3 客户端： ACK820
四次挥手：
    1 FIN 客户端
    2 ACK  服务器
    3 FIN ACK  服务器
    4 ACK 客户端
    
    
'''