'''
tcp的三次握手：
    tcp用三次握手来创建一个链接。
        1 客户端发送一个带SYN标志的TCP报文到服务器：链接请求
            客户端发出段1，SYN位表示连接请求，序号（随机，这里以1000为例）1000，
                这个序号在网络通讯中用作临时地址
                每发一个数据字节，这个序号要加1 这样根据序号在接收端能够排序，并且能确定是否丢包
            mss表示最大段尺寸，如果一个段太大，需要在ip层分段。
        2 服务器回应客户端 带ACK标志和SYN标志: 回应刚刚的链接请求
            服务器发出段2，带有SYN并置ACK位表示确认，确认序号是1001，
                表示：我接收到序号1000及以前的所有段，请下次发送序号1001的段
            同事发出连接请求SYN序号（随机，此处8000为例）8000，同时声明最大尺寸1024
        3 客户必须再次回应服务器段的一个ACK报文 这次是报文段3
            客户端发出段3，对服务器的连接请求进行应答，确认序号是8001
        
'''
'''
数据传输：
    1 客户端发出段4 包含从序号1001开始的20个字节数据
    2 服务器发出段5 确认序号为1021 对序号1001-1021的数据表示确认收到
        同时请求发送序号1021开始的数据，
        服务器应答的序号为8001开始的10个字节
    3 客户端发出段6 对服务器的8001-8010数据表示确认收到，
        请求发送序号8011开始的数据
    
'''
'''
四次挥手 关闭连接
    1 客户端发出段7 FIN位表示关闭链接的请求
    2 服务器发出段8 应答了客户端发送关闭链接的请求
    3 服务器发出段9 其中包含FIN位 向客户端发送关闭链接请求
    4 客户端发出段10 英达服务器的关闭请求
'''