#coding:utf8
''''''
'''
python中 为每一个运行的python程序维护了一个path文件，在sys模块下
    里面存放了导入模块和包的时候 搜寻包和模块的路径列表
    python会从第一个开始一个一个搜索，
    如果全部路径都搜索过还没有搜索到，就会导入失败
'''
import sys
print(sys.path)

#当我们需要导入一个自己写的模块  往往有可能找不到我们的模块，所以这个时候我们要向path里面添加自己的模块路径
# 我们把自己模块所在位置添加到最前面来
sys.path.insert(0,".\\")
print(sys.path)


'''
重新导入：
    模块导入之后实际上常驻内存，如果我们又去修改模块内容，没有重启程序，我们的主进程是不会加载修改过的模块的
    如果再import python会认为这件事已经做过 也不会去导入修改过的模块
    这个时候需要使用重新导入的方法 让程序重新再入模块
    利用imp.reload(包) 的方法
'''
import imp
imp.reload( sys )
